storage/tests/8d78d01a-7715-4acf-b299-509f62268f67/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/8d78d01a-7715-4acf-b299-509f62268f67/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 09/10 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 09/10 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (15.0s), 02/10 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 50     3.13015/s
    checks_succeeded...: 80.00% 40 out of 50
    checks_failed......: 20.00% 10 out of 50

    ✗ status ok
      ↳  80% — ✓ 40 / ✗ 10

    HTTP
    http_req_duration..............: avg=184.51ms min=3.27ms med=9.58ms max=962.71ms p(90)=661.11ms p(95)=748.28ms
      { expected_response:true }...: avg=77.47ms  min=3.27ms med=8.42ms max=365.44ms p(90)=282.99ms p(95)=326.05ms
    http_req_failed................: 20.00% 10 out of 50
    http_reqs......................: 50     3.13015/s

    EXECUTION
    iteration_duration.............: avg=13.73s   min=10.98s med=13.79s max=15.97s   p(90)=15.79s   p(95)=15.88s  
    iterations.....................: 10     0.62603/s
    vus............................: 2      min=2        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 24 kB  1.5 kB/s
    data_sent......................: 15 kB  938 B/s



running (16.0s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s